"Common.Cancel" = "取消";

"Common.OK" = "确定";

"Common.Info" = "信息";

"Common.Warning" = "警告";

"Common.Error" = "错误";

"Common.Yes" = "是";

"Common.No" = "否";

"Common.Settings" = "设置";

"Common.Logout" = "注销";

/* MARK: - Endpoint */
"Endpoint.Training" = "https://ubilabstest.sapsailing.com";

/* MARK: - RegattaCheckInController */
"RegattaCheckInController.WelcomeAlert.Title" = "%@，您好";

"RegattaCheckInController.WelcomeAlert.Message" = "您正在以%@身份登录。";

"RegattaCheckInController.WelcomeAlert.CancelAction.Title" = "不是本人！";

/* MARK: - GPSFixController */
"GPSFixController.Mode" = "模式";

"GPSFixController.Mode.Error" = "API 错误";

"GPSFixController.Mode.BatterySaving" = "省电";

"GPSFixController.Mode.None" = "-";

"GPSFixController.Mode.Online" = "在线";

"GPSFixController.Mode.Offline" = "离线";

/* MARK: - LocationManager */
"LocationManager.LocationServicesDeniedError" = "此应用程序的 GPS 已关闭，但跟踪需要 GPS 位置。是否在定位设置中打开 GPS？";

"LocationManager.LocationServicesDisabledError" = "GPS 已关闭，但跟踪需要 GPS 位置。是否在定位设置中打开 GPS？";

"LocationManager.Status" = "状态";

"LocationManager.Status.Tracking" = "跟踪";

"LocationManager.Status.NotTracking" = "无 GPS 信号！";

/* MARK: - CheckInDataCollectorError */
"CheckInDataCollectorError.CheckInDataIsIncomplete" = "未在二维码中找到参赛队或标志编号。";

/* MARK: - CheckInRequestManagerError */
"CheckInRequestManagerError.CommunicationFailed" = "无法在服务器中完成操作。请重试。";

"CheckInRequestManagerError.GetBoatFailed" = "无法获取船只。";

"CheckInRequestManagerError.GetCompetitorFailed" = "无法获取参赛队。";

"CheckInRequestManagerError.GetEventFailed" = "无法获取活动。";

"CheckInRequestManagerError.GetLeaderboardFailed" = "无法获取积分榜。";

"CheckInRequestManagerError.GetMarkFailed" = "无法获取标志。";

"CheckInRequestManagerError.GetTeamFailed" = "无法获取船队。";

"CheckInRequestManagerError.PostCheckInFailed" = "签到失败。";

"CheckInRequestManagerError.PostCheckOutFailed" = "签退失败。";

"CheckInRequestManagerError.PostGPSFixFailed" = "无法发送 GPS 位置。";

"CheckInRequestManagerError.PostTeamImageFailed" = "无法更新船队图像。";

"CheckInRequestManagerError.TeamImageURLIsInvalid" = "船队图像 URL 无效。";

/* MARK: - StartView */
"StartView.RegattaButton.Title" = "比赛";

"StartView.TrainingButton.Title" = "单一培训";

/* MARK: - AboutView */
"AboutView.Title" = "关于此应用";

"AboutView.PartnershipTextView.Text" = "SAP Sail InSight 应用通过利用移动电话技术支持赛艇的实时跟踪，朋友和粉丝可以通过实况积分榜和二维可视化在现场或在线跟踪比赛。关注比赛水手可以重播其比赛轮次，以便评估表现并优化 https://www.sapsailing.com 中提供的所有策略\n\nSAP 通过实施一系列创新的技术解决方案为 US Sailing 提供支持，提供分析以帮助船队和水手提高成绩，同时还提供应用程序以使帆船运营更有效率。\n\n作为帆船的全国管理机构，US Sailing 领导这项运动并为其提供全面的发展空间，包括为教练和赛事官员提供培训和教育计划，以及管理和监督全国各地的竞技帆船活动。";

"AboutView.TermsButton.Title" = "最终用户许可协议";

"AboutView.VersionTitleLabel.Text" = "版本";

/* MARK: - CourseView */
"CourseView.TitleLabel.Text" = "对地航向";

/* MARK: - RegattaCheckInListView */
"RegattaCheckInListView.Title" = "比赛";

"RegattaCheckInListView.HeaderTitleLabel.Text" = "您的比赛：";

"RegattaCheckInListView.FooterTextView.Text" = "更多信息，请访问\nhttps://sapsailing.com";

"RegattaCheckInListView.InfoCodeLabel.Text" = "二维码可在确认参与时找到。";

"RegattaCheckInListView.TermsAlert.Title" = "最终用户许可协议";

"RegattaCheckInListView.TermsAlert.Message" = "使用此应用即表示您确认接受 SAP SE 最终用户许可协议。请阅读此处的“最终用户许可协议”。";

"RegattaCheckInListView.TermsAlert.ShowTermsAction.Title" = "最终用户许可协议";

"RegattaCheckInListView.TermsAlert.AcceptTermsAction.Title" = "确认";

"RegattaCheckInListView.NoCameraAlert.Message" = "设备没有照相机。";

"RegattaCheckInListView.NoCodeAlert.Title" = "没有二维码？";

"RegattaCheckInListView.NoCodeAlert.Message" = "如果没有收到二维码，请联系赛事管理。";

/* MARK: - TrainingCheckInListView */
"TrainingCheckInListView.Title" = "培训";

"TrainingCheckInListView.HeaderTitleLabel.Text" = "您的培训：";

"TrainingCheckInListView.FooterTextView.Text" = "要管理您的培训课程，请使用加号按钮至少创建一个培训。";

/* MARK: - TrainingView */
"TrainingView.LeaderboardButton.Title" = "分析";

"TrainingView.OptionSheet.CheckOutAction.Title" = "移除培训";

"TrainingView.FinishButton.Title" = "完成";

"TrainingView.ReactivateAlert.Title" = "重新激活培训";

"TrainingView.ReactivateAlert.Message" = "此培训课程已经完成。是否确定继续并重新激活此课程？";

"TrainingView.ReactivatedAlert.Title" = "培训课程现已激活。";

"TrainingView.FinishAlert.Title" = "完成培训";

"TrainingView.FinishAlert.Message" = "是否要完成此培训课程？";

"TrainingView.FinishedAlert.Title" = "此培训课程已成功完成。";

"TrainingView.CheckOutAlert.Message" = "是否确定从设备中移除此培训课程？";

/* MARK: - CreateTrainingView */
"CreateTrainingView.Title" = "创建培训";

"CreateTrainingView.BoatClassNameLabel.Text" = "船只级别";

"CreateTrainingView.CreateTrainingButton.Title" = "创建培训";

/* MARK: - LeaderboardView */
"LeaderboardView.Title" = "积分榜";

/* MARK: - LicenseView */
"LicenseView.Title" = "许可证信息";

/* MARK: - RegattaView */
"RegattaView.CountdownDaysTitleLabel.Text" = "天";

"RegattaView.CountdownHoursTitleLabel.Text" = "小时";

"RegattaView.CountdownMinutesTitleLabel.Text" = "分钟";

"RegattaView.StartLabel.Text.BeforeRegattaDidStart" = "比赛开始于：";

"RegattaView.StartLabel.Text.AfterRegattaDidStart" = "比赛正在进行。";

"RegattaView.AnnouncementLabel.Text" = "请听公告。";

"RegattaView.EventButton.Title" = "活动";

"RegattaView.StartTrackingButton.Title" = "开始跟踪";

"RegattaView.OptionSheet.CheckOutAction.Title" = "签退";

"RegattaView.CheckOutAlert.Message" = "是否确定要注销？您需要使用提供的二维码重新登录才能访问比赛！";

/* MARK: - CompetitorView */
"CompetitorView.SelectImageAlert.Title" = "照片";

"CompetitorView.SelectImageAlert.Message" = "是否使用现有图像或拍一张新图像？";

"CompetitorView.SelectImageAlert.CameraAction.Title" = "拍摄照片";

"CompetitorView.SelectImageAlert.PhotoLibraryAction.Title" = "现有";

"CompetitorView.TeamImageUploadRetryButton.Title" = "上传出错。\n轻按以重试。";

"CompetitorView.TeamImageAddButton.Title" = "添加船队照片";

"CompetitorView.UploadTeamImageFailureAlert.Title" = "上传图像出错";

/* MARK: - ScanView */
"ScanView.Title" = "扫描二维码";

"ScanView.IncorrectCodeAlert.Message" = "二维码无效";

/* MARK: - SpeedView */
"SpeedView.TitleLabel.Text" = "实际速度";

/* MARK: - SettingsView */
"SettingsView.Title" = "设置";

"SettingsView.TableView.BatterySavingSection.Title" = "省电";

"SettingsView.TableView.DeviceSection.Title" = "设备信息";

"SettingsView.TableView.TrainingSection.Title" = "培训专区";

"SettingsView.BatterySavingTitleLabel.Text" = "节能";

"SettingsView.BatterySavingDescriptionLabel.Text" = "GPS 更新每%0.0f秒发送到服务器。";

"SettingsView.DeviceIdentifierTitleLabel.Text" = "设备标识符";

"SettingsView.TrainingServerTitleLabel.Text" = "服务器端点";

/* MARK: - TimerView */
"TimerView.TitleLabel.Text" = "跟踪时间";

/* MARK: - TrackingView */
"TrackingView.TableView.GPSFixesCell.GPSFixesTitleLabel.Text" = "未发送的修复";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyTitleLabel.Text" = "GPS 准确度";

"TrackingView.TableView.GPSAccuracyCell.GPSAccuracyLabel.Text.NoGPS" = "无 GPS";

"TrackingView.StopTrackingButton.Title" = "停止跟踪";

"TrackingView.StopTrackingAlert.Title" = "请确认";

"TrackingView.StopTrackingAlert.Message" = "是否确定停止跟踪？";

